Autodesk.Revit.DB.IFC.IFCData.SetTypeList(System.Collections.Generic.IList`1{System.String})
Sets the corresponding IFC type by its type list name.
Remarks:
This sets the IFC type represented by a string list.
For example, DIMENSION(DIAMETER(INCH(5.0))). It's primitive type is double and the value is 5.0. Its IFC type is DIMENSION/DIAMETER/INCH.
The string list represents the type is "DIMENSION"-"DIAMETER"-"INCH".
typeList:
The strings represent the name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFC.IFCData.SetSimpleType(System.String)
Sets the corresponding IFC type by its name.
typeName:
The name of the type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFC.IFCData.CreateStringOfType(System.String,System.String)
Creates a string data object of the specified type.
value:
The string value.
typeName:
The type name.
Returns:
The IFCData object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFC.IFCData.CreateLogicalOfType(Autodesk.Revit.DB.IFC.IFCLogical,System.String)
Creates a logical data object of the specified type.
value:
The IFCLogical value.
typeName:
The type name.
Returns:
The IFCData object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.IFC.IFCData.CreateBooleanOfType(System.Boolean,System.String)
Creates a boolean data object of the specified type.
value:
The boolean value.
typeName:
The type name.
Returns:
The IFCData object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFC.IFCData.CreateDoubleOfType(System.Double,System.String)
Creates a double data object of the specified type.
value:
The double value.
typeName:
The type name.
Returns:
The IFCData object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFC.IFCData.CreateIntegerOfType(System.Int32,System.String)
Creates an integer data object of the specified type.
value:
The integer value.
typeName:
The type name.
Returns:
The IFCData object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFC.IFCData.CreateIFCAggregate(Autodesk.Revit.DB.IFC.IFCAggregate)
Creates an IFCAggregate data object.
value:
The IFCAggregate value.
Returns:
The IFCData object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFC.IFCData.CreateIFCAnyHandle(Autodesk.Revit.DB.IFC.IFCAnyHandle)
Creates an IFCAnyHandle data object.
value:
The IFCAnyHandle value.
Returns:
The IFCData object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFC.IFCData.CreateEnumeration(System.String)
Creates a enum data object.
value:
The string value.
Returns:
The IFCData object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFC.IFCData.CreateBinary(System.String)
Creates a binary data object.
value:
The string value.
Returns:
The IFCData object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFC.IFCData.CreateString(System.String)
Creates a string data object.
value:
The string value.
Returns:
The IFCData object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFC.IFCData.#ctor(Autodesk.Revit.DB.IFC.IFCData)
Creates a copy object.
from:
The IFCData object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013